Repository: UfSoft/zine-textpress-importer
Catalog: textpress_importer/i18n/*/messages.po
Languages: pt_pt

source: Unknown feed uploaded.
pt_pt: Feed enviado desconhecido.

source: Importing of RSS feeds is currently not possible.
pt_pt: Actualmente não é possível importar feeds RSS.

source: Textpress Export File Download URL
pt_pt: URL do Ficheiro Exportado do Textpress

source: TextPress Importer
pt_pt: Importador do TextPress

source: Don't pass a real feed URL, it should be a regular URL where you're serving the file generated with the textpress_exporter.py script
pt_pt: Não insira um URL do feed real, deve ser um URL normal de onde está a servir o ficheiro gerado com o script textpress_exporter.py

source: Error downloading from URL: %s
pt_pt: Erro no download do URL: %s

source: Error parsing uploaded file
pt_pt: Erro ao ler o arquivo enviado

source: Error parsing feed: %s
pt_pt: Erro ao ler o feed: %s

source: Added imported items to queue.
pt_pt: Os itens importados foram adicionados à fila de trabalho.

source: Import from Textpress
pt_pt: Importar do Textpress

source: This importer can be used to import an exported textpress <b><tt>&lt;blog_name&gt;_export.tpxa</tt></b> file generated with the <b><tt><a href="%(script_link)s" >textpress_exporter.py</a></tt></b> script.<br/> It won't handle attachments, so if your Textpress posts have images or files, you'll have to take care of them yourself and by hand, this is, you will probably have to edit the posts once imported and change the <tt>href</tt> locations to the new URL.
pt_pt: Este importador pode ser usado para importar um ficheiro exportado <b><tt>&lt;blog_name&gt;_export.tpxa</tt></b> textpress gerado com o <b><tt><a href="%(script_link)s" >textpress_exporter.py</a></tt></b> script.<br/> Não lidará com anexos, portando se o seu Textpress inclui imagens ou ficheiros, terá que tomar conta deles voçê mesmo e à mão, isto é, provavelmente terá que editar os seus artigos uma vez importados e mudar a localização <tt>href</tt> para o novo URL

source: It's also very hard to export from Textpress since no version was actually released. All versions are development versions at different stages.<br> The export script tries to abstract from that, however if you find troubles using the export script <a href="%(bugs_link)s">file a ticket</a> and I'll try to address the problem.
pt_pt: É também muito difícil exportar do Textpress porque nenhuma versão foi realmente libertada. Todas as versões são de desenvolvimento em fazes diferentes.<br> O script exportador tenta abstrair-se, contudo se encontrar problemas ao utilizar o script <a href="%(bugs_link)s">submeta um ticket</a> e eu tentarei resolver o problema

source: Upload Textpress Export File
pt_pt: Carregar o Ficheiro Exportado do Textpress

source: Import
pt_pt: Importar
